In [1]:
import pandas as pd
import numpy as np

In [2]:
df_member = pd.read_csv("members.csv")
df_member.head()

,MemberID,Name,Gender,EmailAddress,PhoneNumber,Address,Age,TypeOfMembership,DateOfMembership,Status
0,1,Sarah Johnson,Female,sarah.johnson@email.com,+1-555-0123,123 Oak Street Springfield IL,28,Premium,2022-01-15,Active
1,2,Michael Chen,Male,m.chen@gmail.com,+1-555-0234,456 Pine Avenue Chicago IL,34,Standard,2021-03-22,Active
2,3,Emily Rodriguez,Female,emily.r@hotmail.com,+1-555-0345,789 Maple Drive Evanston IL,22,Student,2023-09-01,Active
3,4,David Thompson,Male,d.thompson@yahoo.com,+1-555-0456,321 Elm Street Naperville IL,45,Premium,2020-06-10,Active
4,5,Lisa Wang,Female,lisa.wang@outlook.com,+1-555-0567,654 Cedar Lane Aurora IL,31,Standard,2022-08-18,Active

In [3]:
df_member.columns

Index(['MemberID', 'Name', 'Gender', 'EmailAddress', 'PhoneNumber', 'Address',
       'Age', 'TypeOfMembership', 'DateOfMembership', 'Status'],
      dtype='object')

In [4]:
df_member["Gender"].unique()

array(['Female', 'Male'], dtype=object)

In [5]:
df_member["Status"].unique()

array(['Active', 'Suspended'], dtype=object)

In [6]:
df_member["EmailAddress"].isnull().sum()

np.int64(0)

In [7]:

df_book_orders = pd.read_csv("bookorders.csv")
df_book_orders.head()

,OrderID,OrderDate,BookID,Cost,Quantity,SupplyDate,FulfillmentStatus,NameOfSupplier
0,1,2024-01-10,1,12.99,5,2024-01-18,Fulfilled,Baker & Taylor
1,2,2024-01-15,22,15.95,8,2024-01-25,Fulfilled,Ingram Book Group
2,3,2024-02-05,30,8.99,10,2024-02-15,Fulfilled,Scholastic
3,4,2024-02-12,7,14.50,6,2024-02-22,Fulfilled,Random House
4,5,2024-02-20,19,13.75,4,2024-03-02,Fulfilled,HarperCollins

In [8]:
df_book_orders.columns

Index(['OrderID', 'OrderDate', 'BookID', 'Cost', 'Quantity', 'SupplyDate',
       'FulfillmentStatus', 'NameOfSupplier'],
      dtype='object')

In [9]:
df_book_orders["FulfillmentStatus"].unique()

array(['Fulfilled', 'Pending', 'Processing'], dtype=object)

In [10]:
df_libary_staff = pd.read_csv("librarystaff.csv")
df_libary_staff.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 25 entries, 0 to 24
Data columns (total 9 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   StaffID       25 non-null     int64
 1   Name          25 non-null     object
 2   JobTitle      25 non-null     object
 3   DepartmentID  25 non-null     int64
 4   Gender        25 non-null     object
 5   Address       25 non-null     object
 6   PhoneNumber   25 non-null     object
 7   HireDate      25 non-null     object
 8   ManagerID     24 non-null     float64
dtypes: float64(1), int64(2), object(6)
memory usage: 1.9+ KB